src/Reports/ОтчетПоНормамSMD/ОтчетПоНормамSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоНормамSMD</name>
  <attributes>
    <name>НаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/НормыSMD/НормыSMD.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыSMD</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаНормоЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛинияSMD</name>
    <type>
      <types>CatalogRef.ЛинииSMD</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыОптическогоТеста/НормыОптическогоТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыОптическогоТеста</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/НормыЭлектроконтроля/НормыЭлектроконтроля.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НормыЭлектроконтроля</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>НормаВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчетПоНормамSMD/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Константы.КодБазы.Получить() = "БГР" Тогда
	Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Богородицк линия SMD",Истина);
	Иначе	
	Подразделение = Справочники.Подразделения.НайтиПоНаименованию("Харьков линия SMD",Истина);
	КонецЕсли; 
		Если Не ОбщийМодульВызовСервера.РазрешенноеПодразделение(Подразделение) Тогда
		Сообщить("У Вас нет прав для просмотра этого отчёта!");
		Отказ = Истина;
		КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
Запрос = Новый Запрос;

ТабДок.Очистить();
СписокЛиний.Очистить();
СписокНоменклатуры.Очистить();

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблШапкаЛиния = Макет.ПолучитьОбласть("Шапка|Линия");
ОблШапкаДопНормы = Макет.ПолучитьОбласть("Шапка|ДопНормы");
ОблМПЗОбщие = Макет.ПолучитьОбласть("МПЗ|Общие");
ОблМПЗЛиния = Макет.ПолучитьОбласть("МПЗ|Линия");
ОблМПЗДопНормы = Макет.ПолучитьОбласть("МПЗ|ДопНормы");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблКонецЛиния = Макет.ПолучитьОбласть("Конец|Линия");
ОблКонецДопНормы = Макет.ПолучитьОбласть("Конец|ДопНормы");	

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛинииSMD.Ссылка
	|ИЗ
	|	Справочник.ЛинииSMD КАК ЛинииSMD
	|ГДЕ
	|	ЛинииSMD.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЛинииSMD.Код";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокЛиний.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла; 
ОблШапкаОбщие.Параметры.НаДату = ТекущаяДата();
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого Линия Из СписокЛиний Цикл
	ОблШапкаЛиния.Параметры.ЛинияSMD = Линия.Значение;
	ТабДок.Присоединить(ОблШапкаЛиния);
	КонецЦикла; 
ТабДок.Присоединить(ОблШапкаДопНормы);

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Родитель В ИЕРАРХИИ(&ГруппыНоменклатуры)
	|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";
Запрос.УстановитьПараметр("ГруппыНоменклатуры",ГруппыНоменклатуры);
Запрос.УстановитьПараметр("Статус",Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Ссылка.ЛинииSMD.Количество() = 0 Тогда
		Продолжить;	
		КонецЕсли;
	СписокНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка,глНаименованиеВСкобкахБезЭтапа(ВыборкаДетальныеЗаписи.Ссылка.Наименование));
	КонецЦикла;
СписокНоменклатуры.СортироватьПоПредставлению();
	Для каждого МПЗ Из СписокНоменклатуры Цикл 
	ОблМПЗОбщие.Параметры.Наименование = СокрЛП(МПЗ.Значение.Наименование);
	ОблМПЗОбщие.Параметры.МПЗ = МПЗ.Значение;
	ОблМПЗОбщие.Параметры.Статус = ПолучитьСтатус(МПЗ.Значение);
	ТабДок.Вывести(ОблМПЗОбщие);
		Для каждого Линия Из СписокЛиний Цикл
			Если МПЗ.Значение.ЛинииSMD.Найти(Линия.Значение,"Линия") <> Неопределено Тогда
			ОблМПЗЛиния.Параметры.КодЛинии = Линия.Значение.Код;
			Иначе			
			ОблМПЗЛиния.Параметры.КодЛинии = 0;			
			КонецЕсли;
		НормыSMD = РегистрыСведений.НормыSMD.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ,ЛинияSMD",МПЗ.Значение,Линия.Значение));
		ОблМПЗЛиния.Параметры.НВ = НормыSMD.НормаВремени;
		ОблМПЗЛиния.Параметры.НЧ = НормыSMD.ЦенаНормоЧаса; 
		ТекОбл = ТабДок.Присоединить(ОблМПЗЛиния);
			Если ОблМПЗЛиния.Параметры.КодЛинии > 0 Тогда
				Если ОблМПЗЛиния.Параметры.НВ = 0 или ОблМПЗЛиния.Параметры.НЧ = 0 Тогда
				ТабДок.Область(ТекОбл.Верх, ТекОбл.Лево, ТекОбл.Низ, ТекОбл.Лево).ЦветФона = WebЦвета.Коралловый;//Новый Цвет(255,0,0);
				КонецЕсли;	
			КонецЕсли; 
		КонецЦикла;
	НормыОТ = РегистрыСведений.НормыОптическогоТеста.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ",МПЗ.Значение));
	ОблМПЗДопНормы.Параметры.Кот = НормыОТ.Коэффициент;
	ОблМПЗДопНормы.Параметры.Рот = НормыОТ.Расценка;
	НормыЭК = РегистрыСведений.НормыЭлектроконтроля.ПолучитьПоследнее(Отчет.НаДату,Новый Структура("МПЗ",МПЗ.Значение));
	ОблМПЗДопНормы.Параметры.НВэк = НормыЭК.НормаВремени;
	ОблМПЗДопНормы.Параметры.Рэк = НормыЭК.Расценка;
	ТабДок.Присоединить(ОблМПЗДопНормы);	 
	КонецЦикла;
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого Линия Из СписокЛиний Цикл
	ТабДок.Присоединить(ОблКонецЛиния);
	КонецЦикла;
ТабДок.Присоединить(ОблКонецДопНормы);
ТабДок.ФиксацияСверху = 2;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура НаДатуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
СтандартнаяОбработка = Ложь;
Ф = ПолучитьФорму("ОбщаяФорма.ВыборМесяца");
Результат = Ф.ОткрытьМодально();
	Если Результат <> Неопределено Тогда
	Отчет.НаДату = НачалоМесяца(Результат);
	КонецЕсли;
КонецПроцедуры
